export const availableWhatNotes = {
  'extract-speed': {
    title: 'سرعت استخراج',
    description: [
      'منظور از سرعت استخراج، مدت زمانی است که برنامه برای جابجایی بین صفحات صبر میکند و سپس فرآیند وارد شدن به آدرس جدید را انجام میدهد.',
      'هدف از این قسمت جلوگیری از شناسایی شدن توسط سیستم های تشخیص بات و سیستم های خودکار، به عنوان ربات است.',
      'گزینه های موجود: ',
      [
        {
          title: 'حداکثر:',
          detail:
            ' در این حالت برنامه هیچ محدودیت سرعتی اعمال نمیکند و برنامه با حداکثر سرعت به جمع آوری اقدام میکند',
        },
        {
          title: 'زیاد (1 صفحه در ثانیه):',
          detail:
            'در این حالت جابجایی بین صفحات هر 1 ثانیه انجام میشود. مثلا جابجایی از صفحه مربوط به volume به صفحه issue و...',
        },
        {
          title: 'متوسط (1 صفحه در 2 ثانیه):',
          detail: 'در این حالت جابجایی هر 2 ثانیه صورت میگیرد',
        },
        {
          title: 'بهینه(1 صفحه در 3.5 ثانیه):',
          detail:
            'در این حالت جابجایی در هر 3 ثانیه و نیم انجام میشود. یک حالت بینابینی که احتمال میرود مناسب باشد.',
        },
        {
          title: 'کم(1 صفحه در 5 ثانیه):',
          detail:
            ' در این حالت جابجایی بین صفحات هر 5 ثانیه صورت میگیرد. این باعث میشود سیستم های مراقبتی سایت هدف، مارا به عنوان ربات تشخیص ندهند.',
        },
      ],
      'درصورتی که عجله ندارید پیشنهاد میشود از گزینه "کم" استفاده کنید.',
    ],
  },

  'extractor-type': {
    title: 'نوع استخراج کننده',
    description: [
      'استخراج کننده، بخشی از نرم افزار است که وظیفه جستجو در صفحات و استخراج اطلاعات را برعهده دارد. در این برنامه 2 نوع استخراج کننده تعریف شده که برحسب نیاز و موقعیت میتواند بجای هم استفاده شوند. برای مثال اگر سیستم شما هنوز با مسئله های "من ربات نیستم" مواجهه نمیشود پیشنهاد ما گزینه اول است.',
      {
        title: 'نوع 1(chrowser):',
        detail:
          'این نوع که حالت پیشفرض است، حالت پایدار و قابل اطمینانی هست که میتواند جستجو را با پایداری  بیشتر و خطای کمتری انجام دهد. اما این نوع در برابر تشخیص دهنده های ربات مثل cloudflare ناتوان است و درصورت مواجهه شدن با چالش های "من ربات نیستم" شما میبایست بصورت دستی مشکل را حل کنید.',
      },
      {
        title: 'نوع 2(puppet):',
        detail:
          'این نوع، در تقابل با چالش های "من ربات نیستم" بهتر عمل میکند و سعی میکند این چالش ها را حل کند، اما بدلیل محدودیت های فنی، احتمال مواجهه شدن با خطا نسبت به نوع 1 بیشتر است و ممکن است در بعضی سناریو های حل چالش با مشکل روبرو شود.',
      },
    ],
  },
};
