export const availableWhatNotes = {
  'extract-speed': {
    title: 'سرعت استخراج',
    description: [
      'منظور از سرعت استخراج، تعداد صفحات رساله (Issue) که در یک ثانیه پردازش میشود،است.',
      'هدف از این قسمت جلوگیری از شناسایی شدن توسط سیستم های تشخیص بات و سیستم های خودکار مثل همین برنامه است.',
      'گزینه های موجود: ',
      [
        {
          title: 'حداکثر:',
          detail:
            ' در این حالت برنامه هیچ محدودیت سرعتی اعمال نمیکند و برنامه با حداکثر سرعت به جمع آوری اقدام میکند',
        },
        {
          title: 'زیاد (1 صفحه در ثانیه):',
          detail:
            'در این حالت در هر ثانیه داده های موجود در یک صفحه رساله یا همان Issue پردازش میشود',
        },
        {
          title: 'متوسط (1 صفحه در 2 ثانیه):',
          detail: 'در این حالت در هر 2 ثانیه یک صفحه پردازش میشود',
        },
        {
          title: 'بهینه(1 صفحه در 5 ثانیه):',
          detail:
            ' در این حالت در هر 5 ثانیه یک صفحه جدید پردازش میشود. این باعث میشود سیستم های مراقبتی سایت هدف، مارا به عنوان ربات تشخیص ندهند.',
        },
      ],
    ],
  },
};
