export const availableWhatNotes = {
  'extract-speed': {
    title: 'سرعت استخراج',
    description: [
      'منظور از سرعت استخراج، تعداد صفحات نشریه (Issue) که در یک ثانیه پردازش میشود،است.',
      'هدف از این قسمت جلوگیری از شناسایی شدن توسط سیستم های تشخیص بات و سیستم های خودکار مثل همین برنامه است.',
      'گزینه های موجود: ',
      [
        {
          title: 'حداکثر:',
          detail:
            ' در این حالت برنامه هیچ محدودیت سرعتی اعمال نمیکند و برنامه با حداکثر سرعت به جمع آوری اقدام میکند',
        },
        {
          title: 'زیاد (1 صفحه در ثانیه):',
          detail:
            'در این حالت جابجایی بین صفحات هر 1 ثانیه انجام میشود. مثلا جابجایی از صفحه مربوط به volume به صفحه issue و...',
        },
        {
          title: 'متوسط (1 صفحه در 2 ثانیه):',
          detail: 'در این حالت جابجایی هر 2 ثانیه صورت میگیرد',
        },
        {
          title: 'بهینه(1 صفحه در 3.5 ثانیه):',
          detail:
            'در این حالت جابجایی در هر 3 ثانیه و نیم انجام میشود. یک حالت بینابینی که احتمال میرود مناسب باشد.',
        },
        {
          title: 'کم(1 صفحه در 5 ثانیه):',
          detail:
            ' در این حالت جابجایی بین صفحات هر 5 ثانیه صورت میگیرد. این باعث میشود سیستم های مراقبتی سایت هدف، مارا به عنوان ربات تشخیص ندهند.',
        },
      ],
      'درصورتی که عجله ندارید پیشنهاد میشود از گزینه "کم" استفاده کنید.',
    ],
  },
};
